[
    {
        "id": "3818364751",
        "publishedAt": "2024-02-05",
        "salary": "",
        "title": "Entry Level Python Developer",
        "jobUrl": "https://www.linkedin.com/jobs/view/entry-level-python-developer-at-synergisticit-3818364751?trk=public_jobs_topcard-title",
        "companyName": "SynergisticIT",
        "companyUrl": "https://www.linkedin.com/company/synergisticit?trk=public_jobs_topcard-org-name",
        "location": "Denver, CO",
        "postedTime": "2 months ago",
        "applicationsCount": "27 applicants",
        "description": "SYNERGISTICIT wants every Job seeker to be aware that the Job Market is Challenging and to stand out you need to have exceptional skills and technologies which make you stand out from other Job seekers.\n\nIf your skills and your project work is similar to others then it's difficult to stand out to the clients. Since 2010 we have helped Jobseekers stand out by ensuring only the best candidates with the requisite skillset go to the clients and they get the attention which they need. We just don't focus on getting you a Job we make careers.\n\nPosition open for all visas and US citizens\n\nWe at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped thousands of candidates get jobs at technology clients like apple, google, Paypal, western union, Client, visa, walmart labs etc to name a few.\n\nWe have an excellent reputation with the clients. Currently, We are looking for Entry Level Python Developer.\n\nWho Should Apply Recent Computer science/Engineering /Mathematics/Statistics or Science Graduates looking to make their careers in IT Industry\n\nWe welcome candidates with all visas and citizens to apply.\n\nWe assist in filing for STEM extension and also for H1b and Green card filing to Candidates\n\nCandidates who are serious about their future in the IT Industry and have set big goals for themselves.\n\nCandidates having difficulty in finding jobs or cracking interviews or who wants to improve their skill portfolio. We also offer Skill enhancement programs if the candidates are missing skills or experience which our clients need with great outcomes\n\nCandidates can benefit from skill enhancement if they fall into the below categories. If they are qualified with enough skills then no need for skill enhancement\n\nCandidates Who Lack Experience\n\nHave had a break in careers\n\nLack Technical Competency\n\nDifferent visa candidates who want to get employed and settle down in the USA\n\nplease also check the below links\n\nhttps://www.synergisticit.com/candidate-outcomes/\n\nhttps://www.youtube.com/watch?v=OAFOhcGy9Z8\n\nhttps://www.synergisticit.com/java-track/\n\nhttps://www.synergisticit.com/data-science-track/\n\nhttps://www.synergisticit.com/which-is-the-best-option-for-tech-job-seekers-staffing-companies-consulting-companies-bootcamps-or-synergisticit/\n\nhttps://www.synergisticit.com/contact-us/\n\nIf not a match candidates can opt for Skill enhancement\n\nFor getting help with interviews please visit\n\nhttps://www.synergisticit.com/interview-questions/\n\nFor data Science/Machine learning\n\nRequired Skills\n\n\n * Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT\n * Project work on the technologies needed\n * Highly motivated, self-learner, and technically inquisitive\n * Experience in programming language Java and understanding of the software development life cycle\n * Knowledge of Statistics, SAS, Python, Computer Vision, data visualization tools\n * Excellent written and verbal communication skills\n   \n   \n\nPreferred skills: NLP, Text mining, Tableau, Time series analysis\n\nPlease understand skills are required by clients for selection even if its Junior or entry level position the additional skills and Project work are the only way a candidate can be picked by clients. If not having the above candidates can opt for skill enhancement to gain the required skills and project work.\n\nNo third-party candidates or c2c candidates\n\nPlease apply to the posting.\n\nNo phone calls please. Shortlisted candidates would be reached out.",
        "contractType": "Contract",
        "experienceLevel": "Entry level",
        "workType": "Information Technology",
        "sector": "IT Services and IT Consulting",
        "companyId": "66321745",
        "posterProfileUrl": "",
        "posterFullName": ""
    },
    {
        "id": "3818361727",
        "publishedAt": "2024-02-05",
        "salary": "",
        "title": "Entry Level Python Developer",
        "jobUrl": "https://www.linkedin.com/jobs/view/entry-level-python-developer-at-synergisticit-3818361727?trk=public_jobs_topcard-title",
        "companyName": "SynergisticIT",
        "companyUrl": "https://www.linkedin.com/company/synergisticit?trk=public_jobs_topcard-org-name",
        "location": "Denver, CO",
        "postedTime": "2 months ago",
        "applicationsCount": "Be among the first 25 applicants",
        "description": "Job Description SYNERGISTICIT wants every candidate to know that the Job Market is Challenging and that to stand out you need to have exceptional skills and technologies that's where we come in to make sure you get the attention that you need\n\nWe are looking for Jobseekers wanting to file H1b visa\n\nPosition open to all visas and US citizens\n\nWe at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped thousands of candidates get jobs at technology clients like Apple, Google, Paypal, western union, Client, visa, Walmart labs etc to name a few.\n\nWe have an excellent reputation with the clients. Currently, We are looking for entry-level software programmers, IT enthusiasts, Python developers, and Data analysts/ Data Scientists.\n\nWe welcome candidates with all visas and citizens to apply.\n\nWe assist in filing for STEM extension and also for H1b and Green card filing to Candidates looking to upskill/enhance their IT skills.\n\nCandidates who are serious about their future in the IT Industry and have set big goals for themselves.\n\nCandidates having difficulty in finding jobs or cracking interviews or who want to improve their skill portfolio. We also offer Skill enhancement programs if the candidates are missing skills or experience which our clients need with great outcomes\n\nCandidates can benefit from skill enhancement if they fall into the below categories. If they are qualified with enough skills then no need for skill enhancement\n\nWe are looking for Jobseekers wanting to file H1b visa\n\nPosition open to all visas and US citizens\n\nCandidates Who Lack Experience\n\nHave had a break in careers\n\nLack Technical Competency\n\nDifferent visa candidates who want to get employed and settle down in the USA\n\nplease also check the below links\n\nhttps://www.synergisticit.com/candidate-outcomes/\n\nhttps://www.synergisticit.com/java-track/\n\nhttps://www.synergisticit.com/data-science-track/\n\nhttps://www.synergisticit.com/blog/\n\nRequired Skills\n\n\n * Bachelor's degree or Master's degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT\n * Highly motivated, self-learner, and technically inquisitive\n * Experience in the programming language Java and understanding of the software development life cycle\n * Knowledge of Statistics, Python, and data visualization tools\n * Excellent written and verbal communication skills\n   \n   \n\nPreferred skills: NLP, Text mining, Tableau, Time series analysis\n\nPlease understand skills are required by clients for selection even if it's a Junior or entry-level position the additional skills are the only way a candidate can be picked by clients.\n\nNo third-party candidates or c2c candidates\n\nTo apply for this position, please apply to the posting\n\nNo phone calls please. Shortlisted candidates would be reached out",
        "contractType": "Contract",
        "experienceLevel": "Entry level",
        "workType": "Information Technology",
        "sector": "IT Services and IT Consulting",
        "companyId": "66321745",
        "posterProfileUrl": "",
        "posterFullName": ""
    },
    {
        "id": "3854215240",
        "publishedAt": "2024-03-13",
        "salary": "",
        "title": "Associate Analyst",
        "jobUrl": "https://www.linkedin.com/jobs/view/associate-analyst-at-janus-henderson-investors-3854215240?trk=public_jobs_topcard-title",
        "companyName": "Janus Henderson Investors",
        "companyUrl": "https://uk.linkedin.com/company/janus-henderson-investors?trk=public_jobs_topcard-org-name",
        "location": "Denver, CO",
        "postedTime": "4 weeks ago",
        "applicationsCount": "Over 200 applicants",
        "description": "Why work for us?\n\n\n\n\nA career at Janus Henderson is more than a job, it’s about investing in a brighter future together.\n\n\n\n\nOur Mission at Janus Henderson is to help clients define and achieve superior financial outcomes through differentiated insights, disciplined investments, and world-class service. We will do this by protecting and growing our core business, amplifying our strengths and diversifying where we have the right.\n\n\n\n\nOur Values are key to driving our success, and are at the heart of everything we do:\n\n\n\n\nClients Come First - Always | Execution Supersedes Intention | Together We Win | Diversity Improves Results | Truth Builds Trust\n\n\n\n\nIf our mission, values, and purpose align with your own, we would love to hear from you!\n\n\n\n\nYour opportunity\n\n\n\n\n * Conduct research on key leverage points of companies, including conversation with management and industry experts\n * Build and maintain a variety of excel based financial models (company, industry/sector, macro)\n * Collect industry and company data through a variety of channels, including sell-side research firms, internal and external databases, trade publications, web scraping, and other online sources\n * Review and organize data, synthesize information, and help identify and analyze trends\n * Independently exercise discretion in expanding assigned projects to improve the stock selection process. Applicant must be an engaging, highly ambitious self-starter\n * Participate in consumer team meetings, company management meetings and general investment team meetings\n * Carry out other duties as assigned\n\n\n\n\nWhat to expect when you join our firm\n\n\n\n\n * Hybrid working and reasonable accommodations\n * Generous Holiday policies\n * Paid volunteer time to step away from your desk and into the community\n * Support to grow through professional development courses, tuition/qualification reimbursement and more\n * All-inclusive approach to Diversity, Equity and Inclusion\n * Maternal/paternal leave benefits and family services\n * Complimentary subscription to Headspace – the mindfulness app\n * Discounted membership to ClassPass and other health and well-being benefits\n * Unique employee events and programs including a 14er challenge\n * Complimentary beverages, snacks and all employee Happy Hours\n\n\n\n\nMust have skills\n\n\n\n\n * Four-year degree in finance, economics, accounting, or related field preferred\n * 1-2 years of equity investment analyst experience\n * Ability to apply valuation tools to models such as ROIC, ROE and be confident around DCFs\n * Ability to analyze financial data as well as accumulate, organize and assimilate large amounts of information\n * Multitasking and organizational skills with the ability to prioritize and coordinate multiple projects in a dynamic environment\n * Advanced computer skills. MS Excel experience required\n * Strong verbal and written communication skills\n * Self-starter with the ability to work and make decisions independently\n * Ability to collaborate and build relationships to enable effective completion of business objectives\n\n\n\n\nNice to have skills\n\n\n\n\n * Demonstrates intellectual curiosity, creativity, and analytical skills in areas of high complexity\n * Strong interpersonal and customer service skills, including the ability to probe for details\n\n\n\n\nInvestment areas\n\n\n\n\nHas responsibility for supporting portfolios that are covered by the centralized equity research team.\n\n\n\n\nSupervisory responsibilities\n\n\n\n\n * No\n\n\n\n\nPotential for growth\n\n\n\n\n * Mentoring\n * Leadership development programs\n * Regular training\n * Career development services\n * Continuing education courses\n\n\n\n\nYou will be expected to understand the regulatory obligations of the firm, and abide by the regulated entity requirements and JHI policies applicable for you role.\n\n\n\n\nAt Janus Henderson Investors we’re committed to an inclusive and supportive environment. We believe diversity improves results and we welcome applications from all backgrounds. Don’t worry if you don’t think you tick every box, we still want to hear from you! We understand everyone has different commitments and while we can’t accommodate every flexible working request we’re happy to be asked about work flexibility and our hybrid working environment. If you need any reasonable accommodations during our recruitment process, please get in touch and let us know at recruiter@janushenderson.com.\n\n\n\n\nCompensation information\n\n\n\n\nThe base salary range for this position is $95,000 - $115,000. This range is estimated for this role. Actual pay may be different. This position will be posted until March 31, 2024.\n\n",
        "contractType": "Full-time",
        "experienceLevel": "Associate",
        "workType": "Finance and Other",
        "sector": "Investment Management and Financial Services",
        "companyId": "164171",
        "posterProfileUrl": "",
        "posterFullName": ""
    },
    {
        "id": "3833868091",
        "publishedAt": "2024-02-24",
        "salary": "",
        "title": "Entry Level Python Developer",
        "jobUrl": "https://www.linkedin.com/jobs/view/entry-level-python-developer-at-synergisticit-3833868091?trk=public_jobs_topcard-title",
        "companyName": "SynergisticIT",
        "companyUrl": "https://www.linkedin.com/company/synergisticit?trk=public_jobs_topcard-org-name",
        "location": "Denver, CO",
        "postedTime": "1 month ago",
        "applicationsCount": "68 applicants",
        "description": "SYNERGISTICIT wants every candidate to know that the Job Market is Challenging and to stand out, you need to have exceptional skills and technologies and that's where we come in to make sure you get the attention which you need.\n\nSynergisticIT understands the complex nature of the job market and how difficult it can be to secure a position, especially for fresh graduates. Therefore, we assist and help tech-savvies to convert their passions into professions. We go above and beyond to keep you working in your niche.\n\nAs we focus on long-term success, we provide complete career development solutions. From job search to upskilling portfolio and interview preparation, we can guide you at every step of your career.\n\nSynergisticIT spares no efforts to connect you with a large network of tech giants, including Google, Apple, PayPal, Dell, Cisco, Client, etc. Presently, we are actively looking for entry-level Python Developers with a driven mindset. Get the right opportunity and gain experience in building web-centric solutions on Python.\n\nWho Should Apply : Recent Computer science/Engineering /Mathematics/Statistics or Science Graduates or anyone looking to make their career in IT Industry\n\nWe also assist in filing for STEM extension and H1b and Green card filing.\n\nCandidates who are serious about their future in the IT Industry and have set big goals for themselves.\n\nCandidates having difficulty in finding jobs or cracking interviews or who wants to improve their skill portfolio. We also offer Skill Enhancement Programs if the candidates are missing skills or experience which our clients need with great outcomes.\n\nCandidates can benefit from skill enhancement if they fall into the below categories. If they are qualified with enough skills then no need for skill enhancement\n\nCandidates Who Lack Experience\n\nHave had a break in careers\n\nLack Technical Competency\n\nCandidates who want to get employed and make a career in the Tech Industry\n\nPlease Also Check The Below Links\n\nhttps://www.synergisticit.com/candidate-outcomes/\n\nhttps://www.synergisticit.com/java-track/\n\nhttps://www.synergisticit.com/data-science-track/\n\nhttps://www.synergisticit.com/which-is-the-best-option-for-tech-job-seekers-staffing-companies-consulting-companies-bootcamps-or-synergisticit/\n\nhttps://www.synergisticit.com/contact-us/\n\nIf the skills are not a match candidates can opt for Skill enhancement. Or their resume can be sent out to clients to see if responses are achievable\n\nFor data Science/Machine learning\n\nRequired Skills\n\n\n * Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT\n * Highly motivated, self-learner, and technically inquisitive\n * Experience in programming language Java and understanding of the software development life cycle\n * Knowledge of Statistics, Python, data visualization tools\n * Excellent written and verbal communication skills\n   \n   \n\nPreferred skills: NLP, Text mining, Tableau, Time series analysis\n\nTechnical skills are required by clients for selection even if its Junior or entry level position each additional Technical skill helps a candidate's resume to be picked by clients over other job seekers.\n\nClients hire candidates with the right technical skills which they need and reject candidates who lack the required technical skills.\n\nNo third party candidates or c2c candidates\n\nPlease apply to the posting\n\nNo phone calls please. Shortlisted candidates would be reached out",
        "contractType": "Contract",
        "experienceLevel": "Entry level",
        "workType": "Information Technology",
        "sector": "IT Services and IT Consulting",
        "companyId": "66321745",
        "posterProfileUrl": "",
        "posterFullName": ""
    },
    {
        "id": "3818772912",
        "publishedAt": "2024-01-31",
        "salary": "",
        "title": "e",
        "jobUrl": "",
        "companyName": "",
        "companyUrl": "",
        "location": "",
        "postedTime": "",
        "applicationsCount": "",
        "description": "",
        "contractType": "",
        "experienceLevel": "",
        "workType": "",
        "sector": ""
    },
    {
        "id": "3787337327",
        "publishedAt": "2023-12-15",
        "salary": "",
        "title": "Data Analyst",
        "jobUrl": "https://www.linkedin.com/jobs/view/data-analyst-at-lever-middleware-test-company-2-3787337327?trk=public_jobs_topcard-title",
        "companyName": "Lever Middleware Test Company 2",
        "companyUrl": "https://www.linkedin.com/company/lever-middleware-test-company-2?trk=public_jobs_topcard-org-name",
        "location": "Denver, CO",
        "postedTime": "3 months ago",
        "applicationsCount": "90 applicants",
        "description": "Lever builds modern recruiting software for teams to source, interview, and hire top talent. Our team strives to set a new bar for enterprise software with modern, well-designed, real-time apps. We participated in Y Combinator in summer 2012, and since then have raised $73 million. As the applicant tracking system of choice for Netflix, Eventbrite, ClearSlide, change.org, and thousands more leading companies, Lever means you hire the best by hiring together.\n\nLever is an equal opportunity employer. We are committed to providing reasonable accommodations and will work with you to meet your needs. If you are a person with a disability and require assistance during the application process, please don’t hesitate to reach out! We celebrate our inclusive work environment and welcome members of all backgrounds and perspectives. Learn more about our team culture and commitment to diversity and inclusion.",
        "contractType": "Full-time",
        "experienceLevel": "Entry level",
        "workType": "Information Technology",
        "sector": "Technology, Information and Internet",
        "companyId": "19055996",
        "posterProfileUrl": "",
        "posterFullName": ""
    },
    {
        "id": "3853792061",
        "publishedAt": "2024-02-18",
        "salary": "",
        "title": "Data Analyst",
        "jobUrl": "https://www.linkedin.com/jobs/view/data-analyst-at-clearchoice-dental-implant-centers-3853792061?trk=public_jobs_topcard-title",
        "companyName": "ClearChoice Dental Implant Centers",
        "companyUrl": "https://www.linkedin.com/company/clearchoice-dental-implant-centers?trk=public_jobs_topcard-org-name",
        "location": "Greenwood Village, CO",
        "postedTime": "1 month ago",
        "applicationsCount": "128 applicants",
        "description": "Company Overview\n\nClearChoice was founded in 2005 to bring an innovative and patient-focused approach to solve gaps within the dental industry. We’ve experienced strong growth and today, we’re the leader in dental implant treatments. Driven by a collective desire to improve the lives of our prospective patients, we help them reclaim their health and confidence. Beyond restoring teeth, this is about getting their lives back.\n\nThis mission-focused work has enabled us to achieve four straight years of double-digit company growth, yet we’ve only reached 1% of the population that needs our services. We are searching for individuals who can help us continue pursuing our goal of reaching prospective patients and transforming their lives. When you join ClearChoice, you are joining a team of individuals with passion, conviction, and integrity whose mission is to be the platform of hope for our patients. Come help us write the next chapter of our story!\n\n\n\nPosition Summary\n\nIn this role, you’ll apply your expertise in quantitative analysis, data wrangling, presentation of data, and a commercially-driven mindset to help leadership and stakeholders see beyond the numbers. You’ll be a key contributor in the analysis and synthesis of our business drivers to help optimize operational efficiency and effectiveness and fuel company growth. In this fast-paced role, you will have the opportunity to make a significant impact on customer engagement planning and strategy to drive key business outcomes.\n\nDuties/Responsibilities\n * Utilize creative problem-solving and data analysis throughout all facets of our organization while working on and engaging with a team that is core to developing data-driven solutions.\n * Collaborate with business partners, documenting their requirements for new Data and Analytics structures that support their workflow and decision-making processes.\n * Lead analytics projects through the development process, collaborating with a team of data experts, ETL developers, visualization designers and Data Scientists to assure the delivery of a high-quality product.\n * Be accountable for your analysis generating recommended actions and for those recommendations to make a substantive impact on the business.Collaborate with the data science team on the design of data models that will satisfy business needs, drive innovation, and conform to existing design principles.\n * Assuring quality by continuously testing your data products while being developed and after they are deployed in production.\n\nDesired Experience\n\n * 2-4 years of hands-on work experience with SQL.\n * 3+ years of applied analytics in sales, finance, marketing, product, engineering; track record of success.\n * Systematic application of scientific method of problem solving & application of statistical analytic methods. (e.g. hypothesis testing, regression, classification etc.).\n * 2+ years of data management and consulting experience.\n\nRequired Experience & Skills\n\n * Experience establishing ongoing, effective two-way communication within the team and with business stakeholders to ensure customer satisfaction and product delivery success.\n * Strong experience in documenting the data requirements, data strategy, data rules then applying them (standardization, cleanse, and validation).\n * Proficient in scientific research applications, hypothesize and develop analytical approaches for identifying, analyzing, and interpreting trends or patterns in complex data sets\n * 2+ years of hands-on work experience with SQL.\n * Proficient in one or more languages for applied to statistics, data analysis, and machine learning e.g. Python, R.\n * Familiarity with cloud platforms such as AWS, GCP, Azure to use/deploy analytics solutions.\n * 2+ years of applied analytics in sales, finance, marketing, product, engineering; track record of success.\n * BA or BS in a quantitative field (Business, Math/Statistics, Economics, CS, Engineering, or similar). Masters in quantitative field desired.\n\nSalary range $60k - 80k",
        "contractType": "Full-time",
        "experienceLevel": "Entry level",
        "workType": "Information Technology",
        "sector": "Hospitals and Health Care",
        "companyId": "809314",
        "posterProfileUrl": "",
        "posterFullName": ""
    },
    {
        "id": "3872352749",
        "publishedAt": "2024-03-27",
        "salary": "",
        "title": "Python Developer",
        "jobUrl": "https://www.linkedin.com/jobs/view/python-developer-at-teksalt-solutions-3872352749?trk=public_jobs_topcard-title",
        "companyName": "TekSalt Solutions",
        "companyUrl": "https://www.linkedin.com/company/teksalt?trk=public_jobs_topcard-org-name",
        "location": "Denver, CO",
        "postedTime": "2 weeks ago",
        "applicationsCount": "149 applicants",
        "description": "We are looking for Python Developer in Denver, CO or Chicago, IL. Recent Angular Experience, deep knowledge designing and implementing Event Based integration services using Message Brokers such as Kafka, RabbitMQ, etc. If you or know anyone would be interested please reach out to me at praveen.vemula@teksalt.com\n\nTop Skills\n\n4+ years’ experience…\n\nFull Stack Python Django Developer\n\nRecent Angular Experience\n\nDeep knowledge designing and implementing Event Based integration services using Message Brokers such as Kafka, RabbitMQ, etc.\n\nKnowledge of software development lifecycle; preferably with Agile, Kanban/Scrum\n\nExperience with cyber security related workflows/solutions/implementation\n\nResponsibilities\n\nContribute to story refinement/defining requirements.\n\nPerform spike/proof of concept as necessary to mitigate risk or implement new ideas.\n\nCode solutions and unit tests to deliver a requirement/story per the defined acceptance criteria and compliance requirements.\n\nUtilize multiple architectural components (across data, application, business) in design and development of client requirements.\n\nAssist team with resolving technical complexities involved in realizing story work.\n\nDesign/develop/modify architecture components, application interfaces, and solution enablers while ensuring principal architecture integrity is maintained.\n\nDesign/develop/maintain automated test suites (integration, regression, performance)\n\nThe chance to work for the best Information Security team in the world.\n\nWork Environment\n\nFast paced - global environment\n\nThank you,\n\nPraveen\n\nTekSalt Solutions\n\npraveen.vemula@teksalt.com\n\n612-852-4887",
        "contractType": "Contract",
        "experienceLevel": "Mid-Senior level",
        "workType": "Engineering and Information Technology",
        "sector": "IT Services and IT Consulting",
        "companyId": "2833966",
        "posterProfileUrl": "",
        "posterFullName": ""
    },
    {
        "id": "3820651634",
        "publishedAt": "2024-03-17",
        "salary": "",
        "title": "Junior Software Engineer",
        "jobUrl": "https://www.linkedin.com/jobs/view/junior-software-engineer-at-medpace-3820651634?trk=public_jobs_topcard-title",
        "companyName": "Medpace",
        "companyUrl": "https://www.linkedin.com/company/medpace?trk=public_jobs_topcard-org-name",
        "location": "Denver, CO",
        "postedTime": "3 weeks ago",
        "applicationsCount": "Over 200 applicants",
        "description": "Medpace's Information Technology team is looking for a full-time, office-based Jr. Software Engineer.\n\nJoin us in building the digital capabilities that accelerate the global development of safe and effective medical therapeutics through clinical trials. In this role, you will work on a team that modernizes and supports Medpace's internal systems. Strong attention to detail, desire for process ownership, and interest in implementing new technology are highly valued. Our Catalyst Rotational Onboarding program will set you up for success with the tech skills and industry knowledge to help you excel.\n\nIf you want an exciting career where you use your previous expertise and can develop and grow your career even further, then this is the opportunity for you.\n\nResponsibilities\n\n\n * Contribute to software development team(s) for one or multiple software applications or initiatives.\n * Build software applications and features in an Agile environment by following our software development lifecycle (SDLC) process.\n * Develop applications in a hybrid and cloud native setting utilizing development skills that include object-oriented programming (C#), databases (SQL), Entity Framework (EF), Angular, and web applications (ASP.NET).\n * Participate in requirements gathering, design, development, testing, release, and support of applications.\n * Collaborate with team members regarding projects, development, tools, and training.\n * Support high level end-user support including feature training and troubleshooting for applications.\n * Contribute to the software validation process through development, review, and/or execution of test plan/cases/scripts.\n * Learn patterns, approaches, and business practices across multiple development teams\n   \n   \n\nQualifications\n\n\n * Bachelor's Degree in Computer Science.\n * Software development experience using C#, Angular or similar JavaScript framework, HTML5, and CSS3.\n * Prior experience using Entity Framework, GitHub, SQL/NoSQL is a plus.\n * Understanding of software development life cycle (SDLC) including release management is a plus.\n * Excellent analytical, written, and oral communication skills.\n * Excellent computer skills.\n   \n   \n\nCompensation:\n\nA target salary range of $70,000 - $145,000. Your compensation will be based on your skills and experience. Medpace offers the following benefits for eligible positions: medical, dental, vision, 401(k), vacation policy, sick days, paid holidays, work from home flexibility, short-term disability, long-term disability, health savings and flexible savings accounts, life and AD&D insurance, and pet insurance. For more details, please discuss with your recruiter.\n\nMedpace Overview\n\nMedpace is a full-service clinical contract research organization (CRO). We provide Phase I-IV clinical development services to the biotechnology, pharmaceutical and medical device industries. Our mission is to accelerate the global development of safe and effective medical therapeutics through its scientific and disciplined approach. We leverage local regulatory and therapeutic expertise across all major areas including oncology, cardiology, metabolic disease, endocrinology, central nervous system, anti-viral and anti-infective. Headquartered in Cincinnati, Ohio, employing more than 5,000 people across 40+ countries.\n\nWhy Medpace?\n\nPeople. Purpose. Passion. Make a Difference Tomorrow. Join Us Today.\n\nThe work we’ve done over the past 30+ years has positively impacted the lives of countless patients and families who face hundreds of diseases across all key therapeutic areas. The work we do today will improve the lives of people living with illness and disease in the future.\n\nDenver Perks\n\n\n * Denver Office Overview\n * Hybrid work-from-home options (dependent upon position and level)\n * Competitive PTO packages, starting at 20+ days\n * Competitive compensation and benefits package\n * Flexible work schedule\n * Company-sponsored employee appreciation events\n * Employee health and wellness initiatives\n * Community involvement with local nonprofit organizations\n * Structured career paths with opportunities for professional growth\n * Discounts on local sports games, fitness gyms and attractions\n * Modern, ecofriendly campus with an on-site fitness center\n * RTD Eco Pass\n * Secure bike storage room\n   \n   \n\nAwards\n\n\n * Recognized by Forbes as one of America's Most Successful Midsize Companies in 2021, 2022, 2023 and 2024\n * Continually recognized with CRO Leadership Awards from Life Science Leader magazine based on expertise, quality, capabilities, reliability, and compatibility\n   \n   \n\nWhat To Expect Next\n\nA Medpace team member will review your qualifications and, if interested, you will be contacted with details for next steps.\n\nEO/AA Employer M/F/Disability/Vets\n\n",
        "contractType": "Contract",
        "experienceLevel": "Entry level",
        "workType": "Engineering and Information Technology",
        "sector": "Pharmaceutical Manufacturing",
        "companyId": "24015",
        "posterProfileUrl": "",
        "posterFullName": ""
    },
    {
        "id": "3858573944",
        "publishedAt": "2024-03-18",
        "salary": "",
        "title": "Dev10 Entry Level Software Developer - Nationwide",
        "jobUrl": "https://www.linkedin.com/jobs/view/dev10-entry-level-software-developer-nationwide-at-genesis10-3858573944?trk=public_jobs_topcard-title",
        "companyName": "Genesis10",
        "companyUrl": "https://www.linkedin.com/company/genesis10?trk=public_jobs_topcard-org-name",
        "location": "Denver, CO",
        "postedTime": "3 weeks ago",
        "applicationsCount": "29 applicants",
        "description": "This job posting is for a Dev10 position that requires you to agree to relocate anywhere in the United States.\n\nDev10 was created to provide an opportunity for those who want to break into the technology industry as a Software Developer but lack the skills or experience to get there on their own. We believe in the unlimited potential of people, and most importantly, the unlimited potential in YOU!\n * Did you realize too late in your degree program that you wished you had pursued technology?\n * Do you wish you could pivot into tech from your current job or career path?\n * Did a friend or family member suggest tech might be a field for you but are unsure where to start or how you would break into it?\n   \n\nHere at Dev10, we are focused on your POTENTIAL, PASSION, and DESIRE TO LEARN regardless of your background or experience. Now hiring for our Software Developer role starting Monday, May 27, 2024. The last day to apply is Thursday, April 11, 2024.\n\nThis job posting is for a Dev10 position that requires you to agree to relocate anywhere in the United States.\n\nWhat We Require\n * Ability to relocate anywhere in the United States\n * Bachelor's Degree in any discipline\n * Unlimited Work Authorization in the United States\n   \n\nWhat We Look For\n * Passion for learning & interest in learning technology skills\n * Logic & reasoning skills\n * Communication skills\n * Teamwork & collaboration skills\n   \n\nWhat We Offer\n * 3 months to focus on building the technical skills needed from the ground up (paid at $600/wk)\n * Guidance from Senior Engineers who are passionate about sharing their expertise in an immersive training environment\n * $2,500 relocation assistance\n * 2 years of project experience with clients\n * Hourly pay rate of $24.04 (equates to $50k annually) or $28.85 (equates to $60k annually) depending on assigned location\n * Dev10 Mentor to help you navigate the corporate culture and support your success\n * Benefits include health, vision, dental, 401k, paid time off\n   \n\nInterested in learning more about whether a career in technology could be a good fit for you? Let's explore this career path together!\n\nFor more information on Dev10, check out our website at http://www.dev-10.com/\n\nAbout Dev10:\nDev10 takes college graduates with the passion and aptitude to be entry-level software developers and provides hands-on training and client project experience all within a full-time paid position. No prior coding experience is required. Dev10 Associates work on exciting projects for Fortune 500 companies. To learn more about our roles within Dev10, please visit us at http://www.dev-10.com/ .",
        "contractType": "Full-time",
        "experienceLevel": "Entry level",
        "workType": "Engineering and Information Technology",
        "sector": "IT Services and IT Consulting",
        "companyId": "9409",
        "posterProfileUrl": "",
        "posterFullName": ""
    }
]